conf/src/Reports/ЭП_ОценкаРезультативностиПоСотруднику/ЭП_ОценкаРезультативностиПоСотруднику.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>ЭП_ОценкаРезультативностиПоСотруднику</name>
</mdclass:Report>

conf/src/InformationRegisters/ЭП_ДанныеТабельногоУчетаРабочегоВремениСотрудников/ЭП_ДанныеТабельногоУчетаРабочегоВремениСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЭП_ДанныеТабельногоУчетаРабочегоВремениСотрудников</name>
  <resources>
    <name>Часы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ПериодРегистрации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ЭП_Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидУчетаВремени</name>
    <type>
      <types>CatalogRef.ЭП_ВидыУчетаВремени</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПериодРегистрацииДень</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

conf/src/InformationRegisters/ЭП_ЭффективностьСотрудников/ЭП_ЭффективностьСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЭП_ЭффективностьСотрудников</name>
  <resources>
    <name>Значение</name>
    <type>
      <types>Characteristic.ЭП_ПоказателиЭффективностиСотрудников</types>
    </type>
  </resources>
  <resources>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <dimensions>
    <name>ПериодОценивания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПрофильРасчета</name>
    <type>
      <types>CatalogRef.ЭП_ПрофилиРасчетаРезультативности</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ЭП_Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Показатель</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ЭП_ПоказателиЭффективностиСотрудников</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

conf/src/Catalogs/ЭП_Сотрудники/ЭП_Сотрудники.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ЭП_Сотрудники</name>
  <attributes>
    <name>Фамилия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отчество</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пол</name>
    <type>
      <types>EnumRef.ЭП_ПолФизическогоЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРождения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Фотография</name>
    <type>
      <types>DefinedType.ПрисоединенныйФайл</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.ЭП_Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорГПХ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Стажёр</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Наставник</name>
    <type>
      <types>CatalogRef.ЭП_Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрограммаОбучения</name>
    <type>
      <types>CatalogRef.ЭП_ПрограммыОбучения</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПринятия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаУвольнения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатусСотрудника</name>
    <type>
      <types>EnumRef.ЭП_СтатусыСотрудников</types>
    </type>
  </attributes>
  <attributes>
    <name>Коментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Департамент</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.ЭП_ПодразделенияОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>Должность</name>
    <type>
      <types>CatalogRef.ЭП_ДолжностиСотрудников</types>
    </type>
  </attributes>
  <attributes>
    <name>ТабельныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФайлРезюме</name>
    <type>
      <types>CatalogRef.Файлы</types>
    </type>
  </attributes>
  <attributes>
    <name>ГрафикРаботы</name>
    <type>
      <types>CatalogRef.Календари</types>
    </type>
  </attributes>
  <attributes>
    <name>СтавкаЧислитель</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтавкаЗнаменатель</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КОД_ЗУП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СсылкаНаПрофиль</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>400</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГрафикРаботыИзЗУП</name>
    <type>
      <types>CatalogRef.Календари</types>
    </type>
  </attributes>
  <attributes>
    <name>НеУчаствуетВИПФ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НеУчаствуетВПЗК</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РаботникВОфисе</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныйЗаКодРевью</name>
    <type>
      <types>CatalogRef.ЭП_Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ГрейдСотрудника</name>
    <type>
      <types>CatalogRef.ЭП_Грейды</types>
    </type>
  </attributes>
  <attributes>
    <name>НеУчаствуетВОбменеСЗУП</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НеУчавствуетВПолученииОкладов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Достижения</name>
    <attributes>
      <name>ВидДостижения</name>
      <type>
        <types>CatalogRef.ЭП_ВидыДостиженийСотрудников</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПлан</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаФакт</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Описание</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РасчетныеПрофили</name>
    <attributes>
      <name>Профиль</name>
      <type>
        <types>CatalogRef.ЭП_ПрофилиРасчетаРезультативности</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

conf/src/ChartsOfCharacteristicTypes/ЭП_ПоказателиЭффективностиСотрудников/ЭП_ПоказателиЭффективностиСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCharacteristicTypes>
  <name>ЭП_ПоказателиЭффективностиСотрудников</name>
  <type>
    <types>Number</types>
    <numberQualifiers>
      <precision>12</precision>
      <scale>2</scale>
    </numberQualifiers>
  </type>
  <predefined>
    <items>
      <name>ФактическаяВыработкаЧасов</name>
      <description>Фактическая выработка часов</description>
      <code>0000000001</code>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </items>
  </predefined>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>МинЗначение</name>
    <type>
      <types>Characteristic.ЭП_ПоказателиЭффективностиСотрудников</types>
    </type>
  </attributes>
  <attributes>
    <name>МаксЗначение</name>
    <type>
      <types>Characteristic.ЭП_ПоказателиЭффективностиСотрудников</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Аббревиатура</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПоПроекту</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:ChartOfCharacteristicTypes>

conf/src/Reports/ЭП_ОценкаРезультативностиПоСотруднику/Forms/ФормаОтчета/Module.bsl
&НаСервере
Процедура РезультатОбработкаРасшифровкиНаСервере(Сотрудник)
	
	УстановитьПривилегированныйРежим(Истина);	
		
	Настройки = Отчет.КомпоновщикНастроек.ПолучитьНастройки();
    ПериодОценивания=Настройки.ПараметрыДанных.Элементы.Найти("Период");
		
	ТаблицаДанных = ПоулчитьНаборДанных(НачалоМесяца(ПериодОценивания.Значение), Сотрудник);
	
	ВнешниеНаборыДанных = Новый Структура;
	ВнешниеНаборыДанных.Вставить("тзНабор", ТаблицаДанных);
	
	ОбъектОтчет = РеквизитФормыВЗначение("Отчет");

	СхемаРасшифровки = ОбъектОтчет.ПолучитьМакет("СхемаРасшифровка");  
	
	НастройкиОСКД = СхемаРасшифровки.НастройкиПоУмолчанию;
		
	КомпоновщикМакетаОСКД = Новый КомпоновщикМакетаКомпоновкиДанных;
	
	Макет = КомпоновщикМакетаОСКД.Выполнить(СхемаРасшифровки, НастройкиОСКД);
	
	ПроцессорКомпоновкиОСКД = Новый ПроцессорКомпоновкиДанных;
	
	ПроцессорКомпоновкиОСКД.Инициализировать(Макет,ВнешниеНаборыДанных,,,Ложь);
	
	РезультатРасшифровка.Очистить();
	
	ПроцессорВыводаОСКД = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	
	ПроцессорВыводаОСКД.УстановитьДокумент(РезультатРасшифровка);
	
	ПроцессорВыводаОСКД.Вывести(ПроцессорКомпоновкиОСКД);	
	
КонецПроцедуры

&НаКлиенте
Процедура РезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
	
	ПолеРасшифровки = ПолучитьРасшифровкуНаСервере(Расшифровка);
	
	СтандартнаяОбработка = Ложь;
	РезультатОбработкаРасшифровкиНаСервере(ПолеРасшифровки.Ссылка);
	Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаСтраницаРасшифровка;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПоулчитьНаборДанных(ПериодОценивания, Сотрудник)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЭП_РасчетПоказателейФормулыПоказателей.ЦелевоеЗначение КАК ЦелевоеЗначение,
		|	ЭП_РасчетПоказателейФормулыПоказателей.РасчетныйПрофиль КАК РасчетныйПрофиль,
		|	ЭП_РасчетПоказателейФормулыПоказателей.Показатель КАК Показатель
		|ПОМЕСТИТЬ ВТ_ЦелевыеЗначенияПоказателей
		|ИЗ
		|	Документ.ЭП_РасчетПоказателей.ФормулыПоказателей КАК ЭП_РасчетПоказателейФормулыПоказателей
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЭП_РасчетПоказателей КАК ЭП_РасчетПоказателей
		|		ПО ЭП_РасчетПоказателейФормулыПоказателей.Ссылка = ЭП_РасчетПоказателей.Ссылка
		|ГДЕ
		|	НАЧАЛОПЕРИОДА(ЭП_РасчетПоказателей.Дата, МЕСЯЦ) = &ПериодОценивания
		|	И ЭП_РасчетПоказателей.Проведен
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЭП_ДанныеТабельногоУчетаРабочегоВремениСотрудников.Сотрудник КАК Сотрудник,
		|	СУММА(ЭП_ДанныеТабельногоУчетаРабочегоВремениСотрудников.Часы) КАК Часы,
		|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.ЭП_ПоказателиЭффективностиСотрудников.ФактическаяВыработкаЧасов) КАК Показатель,
		|	ЭП_СотрудникиРасчетныеПрофили.Профиль КАК Профиль
		|ПОМЕСТИТЬ ВТ_ЧасыПоСотруднику
		|ИЗ
		|	РегистрСведений.ЭП_ДанныеТабельногоУчетаРабочегоВремениСотрудников КАК ЭП_ДанныеТабельногоУчетаРабочегоВремениСотрудников
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЭП_Сотрудники.РасчетныеПрофили КАК ЭП_СотрудникиРасчетныеПрофили
		|		ПО ЭП_ДанныеТабельногоУчетаРабочегоВремениСотрудников.Сотрудник = ЭП_СотрудникиРасчетныеПрофили.Ссылка
		|ГДЕ
		|	ЭП_ДанныеТабельногоУчетаРабочегоВремениСотрудников.ВидУчетаВремени = &ВидУчетаВремени
		|	И ЭП_ДанныеТабельногоУчетаРабочегоВремениСотрудников.Сотрудник = &Сотрудник
		|	И ЭП_ДанныеТабельногоУчетаРабочегоВремениСотрудников.ПериодРегистрации = &ПериодОценивания
		|
		|СГРУППИРОВАТЬ ПО
		|	ЭП_ДанныеТабельногоУчетаРабочегоВремениСотрудников.Сотрудник,
		|	ЭП_СотрудникиРасчетныеПрофили.Профиль
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЭП_ЭффективностьСотрудников.ПрофильРасчета КАК ПрофильРасчета,
		|	ЭП_ЭффективностьСотрудников.Показатель КАК Показатель,
		|	ЭП_ЭффективностьСотрудников.Ответственный КАК Ответственный,
		|	ЭП_ЭффективностьСотрудников.Значение КАК ЗначениеПоказателя,
		|	ЭП_ЭффективностьСотрудников.Комментарий КАК Комментарий,
		|	ВТ_ЦелевыеЗначенияПоказателей.ЦелевоеЗначение КАК ЦелевоеЗначение
		|ИЗ
		|	РегистрСведений.ЭП_ЭффективностьСотрудников КАК ЭП_ЭффективностьСотрудников
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЦелевыеЗначенияПоказателей КАК ВТ_ЦелевыеЗначенияПоказателей
		|		ПО ЭП_ЭффективностьСотрудников.ПрофильРасчета = ВТ_ЦелевыеЗначенияПоказателей.РасчетныйПрофиль
		|			И ЭП_ЭффективностьСотрудников.Показатель = ВТ_ЦелевыеЗначенияПоказателей.Показатель
		|ГДЕ
		|	ЭП_ЭффективностьСотрудников.Сотрудник = &Сотрудник
		|	И ЭП_ЭффективностьСотрудников.ПериодОценивания = &ПериодОценивания
		|	И НЕ ЭП_ЭффективностьСотрудников.Значение = 0
		|	И НЕ ВТ_ЦелевыеЗначенияПоказателей.Показатель = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ЭП_ПоказателиЭффективностиСотрудников.ФактическаяВыработкаЧасов)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТ_ЦелевыеЗначенияПоказателей.РасчетныйПрофиль,
		|	ВТ_ЦелевыеЗначенияПоказателей.Показатель,
		|	ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка),
		|	ВТ_ЧасыПоСотруднику.Часы,
		|	""Автоматический расчет"",
		|	ВЫРАЗИТЬ(ВТ_ЧасыПоСотруднику.Часы * 0.9 КАК ЧИСЛО(15, 2))
		|ИЗ
		|	ВТ_ЦелевыеЗначенияПоказателей КАК ВТ_ЦелевыеЗначенияПоказателей
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ЧасыПоСотруднику КАК ВТ_ЧасыПоСотруднику
		|		ПО ВТ_ЦелевыеЗначенияПоказателей.Показатель = ВТ_ЧасыПоСотруднику.Показатель
		|			И ВТ_ЦелевыеЗначенияПоказателей.РасчетныйПрофиль = ВТ_ЧасыПоСотруднику.Профиль
		|
		|УПОРЯДОЧИТЬ ПО
		|	ПрофильРасчета";
	
	Запрос.УстановитьПараметр("ПериодОценивания", ПериодОценивания);
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	Запрос.УстановитьПараметр("ВидУчетаВремени", Справочники.ЭП_ВидыУчетаВремени.Явка);
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выгрузить();	

КонецФункции

&НаСервере
Функция ПолучитьРасшифровкуНаСервере(Расшифровка)

	Данные = ПолучитьИзВременногоХранилища(ДанныеРасшифровки);
	Поля = Данные.Элементы.Получить(Расшифровка).ПолучитьПоля();
	Сотрудник = Данные.Элементы[7].ПолучитьПоля();
	Ссылка = Сотрудник[0].Значение;
	СсылкаСотрудника = Новый Структура;
	СсылкаСотрудника.Вставить("Ссылка", Ссылка);
	Возврат СсылкаСотрудника;
	
КонецФункции
